 {
  "title": "Azure Solutions Architect Expert AZ 305",
  "subtitle": "A master course designed for working professionals like you. Make your career soar with Loyal Bytes.",
  "heroImage": "/images/course-page/azure-hero-image.png",
  "heroBg": "/images/course-page/azure-hero-bg.png",
  "courseDetail": {
    "duration": "40 Hours",
    "certification": "AZ - 104 and Azure Administrator Associate",
    "batchInfo": "Weekend and weekdays batches available",
    "level": "200",
    "highlights": [
      {
        "icon": "user",
        "color": "orange",
        "heading": "Duration",
        "subheading": "50 Hours."
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Batch Days",
        "subheading": "Weekends & Weekdays"
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Learning mode",
        "subheading": "Group, One-to-One, Corporate Batches, Online Live Classrooms"
      },
      {
        "icon": "user",
        "color": "orange",
        "heading": "Passing score",
        "subheading": "700"
      }
    ],
    "bg": "blue",
    "displayImage": "/images/course-page/azure-hightlights-image.png",
    "description": [
      "Candidates for this exam should have advanced experience and knowledge of IT operations, including networking, virtualization, identity, security, business continuity, disaster recovery, data platforms, and governance. A professional in this role should manage how decisions in each area affect an overall solution. In addition, they should have experience in Azure administration, Azure development, and DevOps processes.",
      "Candidates for the Azure Solutions Architect Expert certification should have subject matter expertise in designing cloud and hybrid solutions that run on Microsoft Azure, including compute, network, storage, monitoring, and security.",
      "Responsibilities for this role include advising stakeholders and translating business requirements into designs for secure, scalable, and reliable Azure solutions.",
      "An Azure solutions architect partners with developers, administrators, and other roles responsible for implementing solutions on Azure.",
      "A candidate for this certification should have advanced experience and knowledge of IT operations, including networking, virtualization, identity, security, business continuity, disaster recovery, data platforms, and governance.",
      "A professional in this role should manage how decisions in each area affect an overall solution. In addition, they should have experience in Azure administration, Azure development, and DevOps processes."
    ]
  },
  "idealFor": [
    "Candidates for the Azure Solutions Architect Expert certification should have subject matter expertise in designing cloud and hybrid solutions that run on Microsoft Azure, including compute, network, storage, monitoring, and security.",
    "Responsibilities for this role include advising stakeholders and translating business requirements into designs for secure, scalable, and reliable Azure solutions.",
    "An Azure Solutions Architect partners with developers, administrators, and other roles responsible for implementing solutions on Azure.",
    "A candidate for this certification should have advanced experience and knowledge of IT operations, including networking, virtualization, identity, security, business continuity, disaster recovery, data platforms, and governance. A professional in this role should manage how decisions in each area affect an overall solution.",
    "In addition, they should have experience in Azure administration, Azure development, and DevOps processes."
  ],
  "learningObjectives": "Create beautiful web flow. Learn how to migrate and host on Microsoft Azure",
  "modules": [
    {
      "title": "Module 1: DESIGN IDENTITY, GOVERNANCE, AND MONITORING SOLUTIONS (25-30%)",
      "submodules": [
        {
          "heading": "DESIGN A SOLUTION FOR LOGGING AND MONITORING",
          "contents": [
            "Design a log routing solution",
            "Recommend an appropriate level of logging",
            "Recommend monitoring tools for a solution"
          ]
        },
        {
          "heading": "DESIGN AUTHENTICATION AND AUTHORIZATION SOLUTIONS",
          "contents": [
            "Recommend a solution for securing resources with role-based access control",
            "Recommend an identity management solution",
            "Recommend a solution for securing identities"
          ]
        },
        {
          "heading": "DESIGN GOVERNANCE",
          "contents": [
            "Recommend an organizational and hierarchical structure for Azure resources",
            "Recommend a solution for enforcing and auditing compliance"
          ]
        }
      ]
    },
    {
      "title": "Module 2: DESIGN DATA STORAGE SOLUTIONS (25-30%)",
      "submodules": [
        {
          "heading": "DESIGN A DATA STORAGE SOLUTION FOR RELATIONAL DATA",
          "contents": [
            "Recommend database service tier sizing",
            "Recommend a solution for database scalability",
            "Recommend a solution for encrypting data at rest, data in transmission, and data in use"
          ]
        },
        {
          "heading": "DESIGN DATA INTEGRATION",
          "contents": [
            "Recommend a solution for data integration",
            "Recommend a solution for data analysis"
          ]
        },
        {
          "heading": "RECOMMEND A DATA STORAGE SOLUTION",
          "contents": [
            "Recommend a solution for storing relational data",
            "Recommend a solution for storing semi-structured data",
            "Recommend a solution for storing non-relational data"
          ]
        },
        {
          "heading": "DESIGN A DATA STORAGE SOLUTION FOR NON-RELATIONAL DATA",
          "contents": [
            "Recommend access control solutions to data storage",
            "Recommend a data storage solution to balance features, performance, and cost",
            "Design a data solution for protection and durability"
          ]
        }
      ]
    },
    {
      "title": "Module 3: DESIGN BUSINESS CONTINUITY SOLUTIONS (10-15%)",
      "submodules": [
        {
          "heading": "DESIGN A SOLUTION FOR BACKUP AND DISASTER RECOVERY",
          "contents": [
            "Recommend a recovery solution for Azure, hybrid, and on-premises workloads that meets recovery objectives (Recovery Time Objective [RTO], Recovery Level Objective [RLO], Recovery Point Objective [RPO])",
            "Understand the recovery solutions for containers",
            "Recommend a backup and recovery solution for compute",
            "Recommend a backup and recovery solution for databases",
            "Recommend a backup and recovery solution for unstructured data"
          ]
        },
        {
          "heading": "DESIGN FOR HIGH AVAILABILITY",
          "contents": [
            "Identify the availability requirements of Azure resources",
            "Recommend a high availability solution for compute",
            "Recommend a high availability solution for non-relational data storage",
            "Recommend a high availability solution for relational data storage"
          ]
        }
      ]
    },
    {
      "title": "Module 4: DESIGN INFRASTRUCTURE SOLUTIONS (25-30%)",
      "submodules": [
        {
          "heading": "DESIGN A COMPUTE SOLUTION",
          "contents": [
            "Recommend a virtual machine-based compute solution",
            "Recommend an appropriately sized compute solution based on workload requirements",
            "Recommend a container-based compute solution",
            "Recommend a serverless-based compute solution"
          ]
        },
        {
          "heading": "DESIGN AN APPLICATION ARCHITECTURE",
          "contents": [
            "Recommend a caching solution for applications",
            "Recommend a messaging architecture",
            "Recommend an event-driven architecture",
            "Recommend an automated deployment solution for your applications",
            "Recommend an application configuration management solution",
            "Recommend a solution for api integration"
          ]
        },
        {
          "heading": "DESIGN MIGRATIONS",
          "contents": [
            "Evaluate a migration solution that leverages the Cloud Adoption Framework for Azure",
            "Assess and interpret on-premises servers, data, and applications for migration",
            "Recommend a solution for migrating applications and virtual machines",
            "Recommend a solution for migrating databases",
            "Recommend a solution for migrating unstructured data"
          ]
        },
        {
          "heading": "DESIGN NETWORK SOLUTIONS",
          "contents": [
            "Recommend a network architecture solution based on workload requirements",
            "Recommend a connectivity solution that connects azure resources to the internet",
            "Recommend a connectivity solution that connects azure resources to on-premises networks",
            "Optimize network performance for applications",
            "Recommend a solution to optimize network security",
            "Recommend a load balancing and routing solution"
          ]
        }
      ]
    }
  ],
  "onCompletion": [
    "The bullets that follow each of the skills measured are intended to illustrate how we are assessing that skill. Related topics may not be covered in the exam.",
    "Most questions cover features that are general availability (GA). The exam may contain questions on Preview features if those features are commonly used."
  ],
  "batches": [
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    }
  ]
}