 {
  "title": "Azure Data Fundamentals - 900",
  "subtitle": "A master course designed for working professionals like you. Make your career soar with Loyal Bytes.",
  "heroImage": "/images/course-page/azure-hero-image.png",
  "heroBg": "/images/course-page/azure-hero-bg.png",
  "courseDetail": {
    "duration": "8 Hours",
    "certification": "Microsoft Certification",
    "batchInfo": "Weekdays batches available",
    "level": "100",
    "highlights": [
      {
        "icon": "user",
        "color": "orange",
        "heading": "Duration",
        "subheading": "8 Hours."
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Batch Days",
        "subheading": "Weekdays"
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Learning mode",
        "subheading": "Group, One-to-One, Corporate Batches, Online Live Classrooms"
      },
      {
        "icon": "user",
        "color": "orange",
        "heading": "Passing score",
        "subheading": "700"
      }
    ],
    "bg": "blue",
    "displayImage": "/images/course-page/azure-hightlights-image.png",
    "description": [
      "To master data in the cloud, you need the right foundation—a solid understanding of core data concepts, such as relational data, nonrelational data, big data, and analytics. Plus, familiarity with the roles, tasks, and responsibilities in the world of data and data analytics. Are you there? Certification can help you prove it.",
      "The certification offers the foundation you need to build your technical skills to start working with data in the cloud. Mastering the basics can help you jump-start your career and prepare you to dive deeper into other technical opportunities Azure offers.",
      "The Microsoft Certified: Azure Data Fundamentals certification could be a great fit for you if you’d like to",
      "Validate your foundational knowledge of core data concepts and how they’re implemented using Azure data services.",
      "Reinforce your basics for other Azure role-based certifications, like Azure Database Administrator Associate, Azure Data Engineer Associate, Data Analyst Associate, or Azure Developer Associate, but it’s not a prerequisite for any of them.",
      "If you’re new to the cloud or just starting out with Azure, first choose Azure fundamentals training and certification.",
      "If you’re beginning to work with data in the cloud, this certification is for you. It is recommended to have familiarity with the concepts of relational and nonrelational data and with different types of data workloads, such as transactional or analytical."
    ]
  },
  "idealFor": [
    "This exam is an opportunity to demonstrate knowledge of core data concepts and related Microsoft Azure data services. Candidates for this exam should have familiarity with DP-900's self-paced or instructor-led learning material.",
    "This exam is intended for candidates beginning to work with data in the cloud.",
    "Candidates should be familiar with the concepts of relational and non-relational data, and different types of data workloads such as transactional or analytical.",
    "Azure Data Fundamentals can be used to prepare for other Azure role-based certifications like Azure Database Administrator Associate or Azure Data Engineer Associate, but it is not a prerequisite for any of them."
  ],
  "learningObjectives": "Validate your foundational knowledge of core data concepts and how they&apos;re implemented using Azure data services. Reinforce your basics for other Azure role-based certifications, like Azure Database Administrator Associate, Azure Data Engineer Associate, Data Analyst Associate, or Azure Developer Associate, but it’s not a prerequisite for any of them.",
  "modules": [
    {
      "title": "Module 1:\tDESCRIBE CORE DATA CONCEPTS (25–30%)",
      "submodules": [
        {
          "heading": "DESCRIBE WAYS TO REPRESENT DATA",
          "contents": [
            "Describe features of structured data",
            "Describe features of semi-structured ",
            "Describe features of unstructured data "
          ]
        },
        {
          "heading": "IDENTIFY OPTIONS FOR DATA STORAGE",
          "contents": [
            "Describe common formats for data files ",
            "Describe types of databases "
          ]
        },
        {
          "heading": "DESCRIBE COMMON DATA WORKLOADS ",
          "contents": [
            "Describe features of transactional workloads ",
            "Describe features of analytical workloads "
          ]
        },
        {
          "heading": "DESCRIBE COMMON DATA WORKLOADS ",
          "contents": [
            "Describe features of analytical workloads",
            "Describe features of transactional workloads"
          ]
        },
        {
          "heading": "IDENTIFY ROLES AND RESPONSIBILITIES FOR DATA WORKLOADS ",
          "contents": [
            "Describe responsibilities for database administrators ",
            "Describe responsibilities for data engineers ",
            "Describe responsibilities for data analysts"
          ]
        }
      ]
    },
    {
      "title": "Module 2: IDENTIFY CONSIDERATIONS FOR RELATIONAL DATA ON AZURE (20–25%) ",
      "submodules": [
        {
          "heading": "DESCRIBE RELATIONAL CONCEPTS ",
          "contents": [
            "Identify features of relational data ",
            "Describe normalization and why it is used ",
            "Identify common structured query language (SQL) statements ",
            "Identify common database objects "
          ]
        },
        {
          "heading": "DESCRIBE RELATIONAL AZURE DATA SERVICES ",
          "contents": [
            "Describe the Azure SQL family of products including Azure SQL Database, Azure SQL ",
            "Managed Instance, and SQL Server on Azure Virtual Machines ",
            "Identify Azure database services for open-source database systems "
          ]
        }
      ]
    },
    {
      "title": "Module 3: DESCRIBE CONSIDERATIONS FOR WORKING WITH NON-RELATIONAL DATA ON AZURE (15–20%) ",
      "submodules": [
        {
          "heading": "9.3.1\tDESCRIBE CAPABILITIES OF AZURE STORAGE ",
          "contents": [
            "Describe Azure Blob storage ",
            "Describe Azure File storage ",
            "Describe Azure Table storage "
          ]
        },
        {
          "heading": "DESCRIBE CAPABILITIES AND FEATURES OF AZURE COSMOS DB ",
          "contents": [
            "Identify use cases for Azure Cosmos DB ",
            "Describe Azure Cosmos DB APIs "
          ]
        }
      ]
    },
    {
      "title": "Module 4: DESCRIBE AN ANALYTICS WORKLOAD ON AZURE (25–30%) ",
      "submodules": [
        {
          "heading": "DESCRIBE COMMON ELEMENTS OF A MODERN DATA WAREHOUSE ",
          "contents": [
            "Describe considerations for data ingestion and processing ",
            "Describe options for analytical data stores ",
            "Describe Azure services for data warehousing, including Azure Synapse Analytics, Azure Databricks, Azure HDInsight, and Azure Data Factory "
          ]
        },
        {
          "heading": "DESCRIBE CONSIDERATION FOR REAL-TIME DATA ANALYTICS ",
          "contents": [
            "Describe the difference between batch and streaming data ",
            "Describe technologies for real-time analytics including Azure Stream Analytics, Azure Synapse Data Explorer, and Spark structured streaming "
          ]
        },
        {
          "heading": "DESCRIBE DATA VISUALIZATION IN MICROSOFT POWER BI ",
          "contents": [
            "Identify capabilities of Power BI ",
            "Describe features of data models in Power BI ",
            "Identify appropriate visualizations for data "
          ]
        }
      ]
    }
  ],
  "onCompletion": [
    "The bullets that follow each of the skills measured are intended to illustrate how we are assessing that skill. Related topics may be covered in the exam. ",
    "Most questions cover features that are general availability (GA). The exam may contain questions on Preview features if those features are commonly used."
  ],
  "batches": [
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    }
  ]
}