 {
  "title": "Azure Developer Associate AZ - 204",
  "subtitle": "A master course designed for working professionals like you. Make your career soar with Loyal Bytes.",
  "heroImage": "/images/course-page/azure-hero-image.png",
  "heroBg": "/images/course-page/azure-hero-bg.png",
  "courseDetail": {
    "duration": "32 Hours",
    "certification": "AZ - 204 and Developing Solutions for Microsoft Azure",
    "batchInfo": "weekdays batches available",
    "level": "200",
    "highlights": [
      {
        "icon": "user",
        "color": "orange",
        "heading": "Duration",
        "subheading": "32 Hours."
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Batch Days",
        "subheading": "Weekdays"
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Learning mode",
        "subheading": "Group, One-to-One, Corporate Batches, Online Live Classrooms"
      },
      {
        "icon": "user",
        "color": "orange",
        "heading": "Passing score",
        "subheading": "700"
      }
    ],
    "bg": "blue",
    "displayImage": "/images/course-page/azure-hightlights-image.png",
    "description": [
      "This program teaches developers how to create end-to-end solutions in Microsoft Azure. Students will learn how to implement Azure compute solutions, create Azure Functions, implement and manage web apps, develop solutions utilizing Azure storage, implement authentication and authorization, and secure their solutions by using KeyVault and Managed Identities. Students will also learn how to connect to and consume Azure services and third-party services and include event- and message-based models in their solutions. The Specialization also covers monitoring, troubleshooting, and optimizing Azure solutions."
    ]
  },
  "idealFor": [
    "Candidates for this exam are cloud developers who participate in all phases of development from requirements definition and design to development, deployment, and maintenance. They partner with cloud DBAs, cloud administrators, and clients to implement solutions.",
    "Candidates should be proficient in Azure SDKs, data storage options, data connections, APIs, app authentication and authorization, compute, and container deployment, debugging, performance tuning, and monitoring.",
    "Candidates should have 1-2 years professional development experience and experience with Microsoft Azure. They should be able to program in an Azure-supported language, and should be proficient using Azure CLI, Azure PowerShell, and other tools."
  ],
  "learningObjectives": "Create beautiful web flow. Learn how to migrate and host on Microsoft Azure",
  "modules": [
    {
      "title": "Module 1: DEVELOP AZURE COMPUTE SOLUTIONS (25-30%)",
      "submodules": [
        {
          "heading": "IMPLEMENT IAAS SOLUTIONS",
          "contents": [
            "Provision virtual machines (VMs)",
            "Configure, validate, and deploy ARM templates ",
            "Configure container images for solutions ",
            "Publish an image to Azure Container Registry ",
            "Run containers by using Azure Container Instance "
          ]
        },
        {
          "heading": "CREATE AZURE APP SERVICE WEB APPS",
          "contents": [
            "Create an Azure App Service Web App",
            "Enable diagnostics logging ",
            "Deploy code to a web app",
            "Configure web app settings including SSL, API settings, and connection strings",
            "Implement autoscaling rules including scheduled autoscaling and autoscaling by operational or system metrics"
          ]
        },
        {
          "heading": "IMPLEMENT AZURE FUNCTIONS",
          "contents": [
            "Create and deploy Azure Functions apps",
            "Implement input and output bindings for a function",
            "Implement function triggers by using data operations, timers, and webhooks",
            "Implement Azure Durable Functions"
          ]
        }
      ]
    },
    {
      "title": "Module 2: DEVELOP FOR AZURE STORAGE (15-20%)",
      "submodules": [
        {
          "heading": "DEVELOP SOLUTIONS THAT USE COSMOS DB STORAGE",
          "contents": [
            "Select the appropriate API and SDK for a solution",
            "Implement partitioning schemes and partition keys",
            "Perform operations on data and Cosmos DB containers",
            "Set the appropriate consistency level for operations",
            "Manage change feed notifications"
          ]
        },
        {
          "heading": "DEVELOP SOLUTIONS THAT USE BLOB STORAGE",
          "contents": [
            "Move items in blob storage between storage accounts or containers",
            "Set and retrieve properties and metadata",
            "Perform operations on data by using the appropriate SDK",
            "Implement storage policies, data archiving, and retention"
          ]
        }
      ]
    },
    {
      "title": "Module 3: IMPLEMENT AZURE SECURITY (20-25%)",
      "submodules": [
        {
          "heading": "IMPLEMENT USER AUTHENTICATION AND AUTHORIZATION",
          "contents": [
            "Authenticate and authorize users by using the Microsoft Identity Platform",
            "Authenticate and authorize users and apps by using Azure Active Directory",
            "Create and implement shared access signatures",
            "Implement solutions with Microsoft Graph"
          ]
        },
        {
          "heading": "IMPLEMENT SECURE CLOUD SOLUTIONS",
          "contents": [
            "Create security rules",
            "Secure app configuration data by using App Configuration or Azure Key Vault ",
            "Develop code that uses keys, secrets, and certificates stored in Azure Key Vault ",
            "Implement Managed Identities for Azure resources "
          ]
        }
      ]
    },
    {
      "title": "Module 4: MONITOR, TROUBLESHOOT, AND OPTIMIZE AZURE SOLUTIONS (15-20%)",
      "submodules": [
        {
          "heading": "IMPLEMENT CACHING FOR SOLUTIONS",
          "contents": [
            "Configure cache and expiration policies for Azure Cache for Redis",
            "Implement secure and optimized application cache patterns including data sizing, connections, encryption, and expiration",
            "Troubleshoot solutions by using metrics and log data",
            "Configure an app or service to use Application Insights",
            "Implement application insights web tests and alerts"
          ]
        }
      ]
    },
    {
      "title": "Module 5: CONNECT TO AND CONSUME AZURE SERVICES AND THIRD-PARTY SERVICES (15-20%)",
      "submodules": [
        {
          "heading": "IMPLEMENT API MANAGEMENT",
          "contents": [
            "Create an APIM instance",
            "Create and document APIs",
            "Configure authentication for APIs ",
            "Define policies for APIs "
          ]
        },
        {
          "heading": "DEVELOP EVENT-BASED SOLUTIONS",
          "contents": [
            "Implement solutions that use Azure Event Grid ",
            "Implement solutions that use Azure Event Hub "
          ]
        },
        {
          "heading": "DEVELOP MESSAGE-BASED SOLUTIONS",
          "contents": [
            "Implement solutions that use Azure Service Bus ",
            "IImplement solutions that use Azure Queue Storage queues "
          ]
        }
      ]
    }
  ],
  "onCompletion": [
    "The bullets that follow each of the skills measured are intended to illustrate how we are assessing that skill. Related topics may be covered in the exam.",
    "Most questions cover features that are general availability (GA). The exam may contain questions on Preview features if those features are commonly used."
  ],
  "batches": [
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    }
  ]
}