 {
  "title": "Cybersecurity Architect Expert SC - 100",
  "subtitle": "A master course designed for working professionals like you. Make your career soar with Loyal Bytes.",
  "heroImage": "/images/course-page/azure-hero-image.png",
  "heroBg": "/images/course-page/azure-hero-bg.png",
  "courseDetail": {
    "duration": "40 Hours",
    "certification": "AZ - 104 and Azure Administrator Associate",
    "batchInfo": "Weekend and weekdays batches available",
    "level": "200",
    "highlights": [
      {
        "icon": "user",
        "color": "orange",
        "heading": "Duration",
        "subheading": "50 Hours."
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Batch Days",
        "subheading": "Saturday & Weekdays"
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Learning mode",
        "subheading": "Group, One-to-One, Corporate Batches, Online Live Classrooms"
      },
      {
        "icon": "user",
        "color": "orange",
        "heading": "Passing score",
        "subheading": "700"
      }
    ],
    "bg": "blue",
    "displayImage": "/images/course-page/azure-hightlights-image.png",
    "description": "The Microsoft cybersecurity architect has subject matter expertise in designing and evolving the cybersecurity strategy to protect an organization’s mission and business processes across all aspects of the enterprise architecture. Candidates for this exam should have advanced experience and knowledge in a wide range of security engineering areas, including identity and access, platform protection, security operations, securing data, and securing applications. They should also have experience with hybrid and cloud implementations."
  },
  "idealFor": "The Microsoft cybersecurity architect has subject matter expertise in designing and evolving the cybersecurity strategy to protect an organization’s mission and business processes across all aspects of the enterprise architecture. The cybersecurity architect designs a Zero Trust strategy and architecture, including security strategies for data, applications, access management, identity, and infrastructure. The cybersecurity architect also evaluates Governance Risk Compliance (GRC) technical strategies and security operations strategies. The cybersecurity architect continuously collaborates with leaders and practitioners in IT security, privacy, and other roles across an organization to plan and implement a cybersecurity strategy that meets the business needs of an organization. A candidate for this certification should have advanced experience and knowledge in a wide range of security engineering areas including identity and access, platform protection, security operations, securing data and securing applications. They should also have experience with hybrid and cloud implementations. To earn the Microsoft Cybersecurity Architect certification, candidates must also pass one of the following exams: SC-200, SC-300, AZ-500, or MS-500. We strongly recommend that you do this before taking this exam.",
  "learningObjectives": "Create beautiful web flow. Learn how to migrate and host on Microsoft Azure",
  "modules": [
    {
      "title": "Module 1: DESIGN A ZERO TRUST STRATEGY AND ARCHITECTURE (30–35%) ",
      "submodules": [
        {
          "heading": "BUILD AN OVERALL SECURITY STRATEGY AND ARCHITECTURE ",
          "contents": [
            "Identify the integration points in an architecture by using Microsoft Cybersecurity Reference Architecture (MCRA) ",
            "Translate business goals into security requirements ",
            "Translate security requirements into technical capabilities, including security services, security products, and security processes ",
            "Design security for a resiliency strategy ",
            "Integrate a hybrid or multi-tenant environment into a security strategy ",
            "Develop a technical and governance strategy for traffic filtering and segmentation "
          ]
        },
        {
          "heading": "DESIGN A SECURITY OPERATIONS STRATEGY ",
          "contents": [
            "Design a logging and auditing strategy to support security operations ",
            "Develop security operations to support a hybrid or multi-cloud environment",
            "Design a strategy for siem and soar ",
            "Evaluate security workflows ",
            "Evaluate a security operations strategy for incident management lifecycle ",
            "Evaluate a security operations strategy for sharing technical threat intelligence "
          ]
        },
        {
          "heading": "DESIGN AN IDENTITY SECURITY STRATEGY (Note: includes hybrid and multi-cloud)",
          "contents": [
            "Design a strategy for access to cloud resources ",
            "Recommend an identity store (tenants, b2b, b2c, hybrid) ",
            "Recommend an authentication strategy ",
            "Recommend an authorization strategy ",
            "Design a strategy for conditional access ",
            "Design a strategy for role assignment and delegation ",
            "Design security strategy for privileged role access to infrastructure including identity-based firewall rules, azure pim ",
            "Design security strategy for privileged activities including pam, entitlement management, cloud tenant administration "
          ]
        }
      ]
    },
    {
      "title": "Module 2: EVALUATE GOVERNANCE RISK COMPLIANCE (GRC) TECHNICAL STRATEGIES AND SECURITY OPERATIONS STRATEGIES (20–25%) ",
      "submodules": [
        {
          "heading": "DESIGN A REGULATORY COMPLIANCE STRATEGY",
          "contents": [
            "Interpret compliance requirements and translate into specific technical capabilities (new or existing) ",
            "Evaluate infrastructure compliance by using microsoft defender for cloud ",
            "Interpret compliance scores and recommend actions to resolve issues or improve security ",
            "Design implementation of azure policy ",
            "Design for data residency requirements ",
            "Translate privacy requirements into requirements for security solutions "
          ]
        },
        {
          "heading": "EVALUATE SECURITY POSTURE AND RECOMMEND TECHNICAL STRATEGIES TO MANAGE RISK",
          "contents": [
            "Evaluate security posture by using benchmarks (including Azure security benchmarks, ISO 2701, etc.) ",
            "Evaluate security posture by using Microsoft Defender for Cloud ",
            "Evaluate security posture by using Secure Scores ",
            "Evaluate security posture of cloud workloads ",
            "Design security for an Azure Landing Zone ",
            "Interpret technical threat intelligence and recommend risk mitigations ",
            "Recommend security capabilities or controls to mitigate identified risks "
          ]
        }
      ]
    },
    {
      "title": "Module 3: DESIGN SECURITY FOR INFRASTRUCTURE (20–25%)",
      "submodules": [
        {
          "heading": "DESIGN A STRATEGY FOR SECURING SERVER AND CLIENT ENDPOINTS (NOTE: includes hybrid and multi-cloud)",
          "contents": [
            "Specify security baselines for server and client endpoints ",
            "Specify security requirements for servers, including multiple platforms and operating systems ",
            "Specify security requirements for mobile devices and clients, including endpoint protection, hardening, and configuration ",
            "Specify requirements to secure active directory domain services ",
            "Design a strategy to manage secrets, keys, and certificates ",
            "Design a strategy for secure remote access "
          ]
        },
        {
          "heading": "DESIGN A STRATEGY FOR SECURING SAAS, PAAS, AND IAAS SERVICES",
          "contents": [
            "Specify security baselines for saas, paas, and iaas services ",
            "Specify security requirements for iot workloads ",
            "Specify security requirements for data workloads, including SQL, Azure SQL Database, Azure Synapse, and Azure Cosmos DB ",
            "Specify security requirements for web workloads, including Azure App Service ",
            "Specify security requirements for storage workloads, including Azure Storage ",
            "Specify security requirements for containers ",
            "Specify security requirements for container orchestration "
          ]
        }
      ]
    },
    {
      "title": "Module 4: DESIGN A STRATEGY FOR DATA AND APPLICATIONS (20–25%) ",
      "submodules": [
        {
          "heading": "SPECIFY SECURITY REQUIREMENTS FOR APPLICATIONS ",
          "contents": [
            "Specify priorities for mitigating threats to applications ",
            "Specify a security standard for onboarding a new application",
            "Specify a security strategy for applications and apis "
          ]
        },
        {
          "heading": "DESIGN A STRATEGY FOR SECURING DATA",
          "contents": [
            "Specify priorities for mitigating threats to data ",
            "Design a strategy to identify and protect sensitive data ",
            "Specify an encryption standard for data at rest and in motion "
          ]
        }
      ]
    }
  ],
  "onCompletion": [
    "The bullets that follow each of the skills measured are intended to illustrate how we are assessing that skill. Related topics may not be covered in the exam.",
    "Most questions cover features that are general availability (GA). The exam may contain questions on Preview features if those features are commonly used."
  ],
  "batches": [
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    }
  ]
}