 {
  "title": "Dynamics 365 Fundamentals (CRM) - 910",
  "subtitle": "A master course designed for working professionals like you. Make your career soar with Loyal Bytes.",
  "heroImage": "/images/course-page/azure-hero-image.png",
  "heroBg": "/images/course-page/azure-hero-bg.png",
  "courseDetail": {
    "duration": "40 Hours",
    "certification": "Microsoft Certification",
    "batchInfo": "Weekdays batches available",
    "level": "100",
    "highlights": [
      {
        "icon": "user",
        "color": "orange",
        "heading": "Duration",
        "subheading": "40 Hours."
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Batch Days",
        "subheading": "Weekdays"
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Learning mode",
        "subheading": "Group, One-to-One, Corporate Batches, Online Live Classrooms"
      },
      {
        "icon": "user",
        "color": "orange",
        "heading": "Passing score",
        "subheading": "700"
      }
    ],
    "bg": "blue",
    "displayImage": "/images/course-page/azure-hightlights-image.png",
    "description": [
      "Whether you are a business stakeholder, functional consultant at the start of your career or a student, this certification is a validation of your broad knowledge of the customer engagement apps in Microsoft Dynamics 365, including marketing capabilities, and the automation of the sales, service and support lifecycles.",
      "The Microsoft Certified: Dynamics Fundamentals (CRM) certification could be a great fit for you if you’d like to",
      "Understand the core capabilities across the Dynamic 365 customer engagement apps",
      "Validate your Dynamics 365 skills",
      "Highlight your understanding of business operations and customer engagement",
      "Demonstrate capability in Dynamics 365 customer engagement capabilities to move to the next level",
      "It is recommended for tech-savvy individuals with some basic knowledge of business functions like marketing, sales, and services."
    ]
  },
  "idealFor": [
    "This exam covers the customer engagement features and capabilities of Dynamics 365 apps.",
    "Candidates of this exam should have a fundamental understanding of customer engagement principles, and business operations, general computer skills"
  ],
  "learningObjectives": "Understand the core capabilities across the Dynamic 365 customer engagement apps. Validate your Dynamics 365 skills. Highlight your understanding of business operations and customer engagement. Demonstrate capability in Dynamics 365 customer engagement capabilities to move to the next level",
  "modules": [
    {
      "title": "Module 1: DESCRIBE DYNAMICS 365 MARKETING (15–20%) ",
      "submodules": [
        {
          "heading": "IDENTIFY DYNAMICS 365 MARKETING CAPABILITIES ",
          "contents": [
            "Describe the process for generating and scoring leads by using marketing forms and pages ",
            "Describe how to target customers by using segments and subscription lists ",
            "Describe email marketing concepts and processes ",
            "Describe the process of automating marketing activities by using customer journeys ",
            "Describe event management features and capabilities including Microsoft Teams webinars "
          ]
        },
        {
          "heading": "DESCRIBE RELATED MARKETING APPS",
          "contents": [
            "Describe the capabilities of Dynamics 365 Customer Voice",
            "Describe the capabilities of Dynamics 365 Customer Insights including Audience Insights and Engagement Insights"
          ]
        }
      ]
    },
    {
      "title": "Module 2: DESCRIBE DYNAMICS 365 SALES (15–20%)",
      "submodules": [
        {
          "heading": "DESCRIBE THE DYNAMICS 365 SALES LIFECYCLE ",
          "contents": [
            "Describe leads and the process for qualifying leads ",
            "Describe the opportunity management process ",
            "Describe the quote lifecycle ",
            "Describe sales pipeline forecasting sales concepts ",
            "Describe capabilities of Dynamics 365 Sales Insights ",
            "Describe capabilities of LinkedIn Sales Navigator "
          ]
        }
      ]
    },
    {
      "title": "Module 3: DESCRIBE DYNAMICS 365 CUSTOMER SERVICE (15–20%) ",
      "submodules": [
        {
          "heading": "DESCRIBE DYNAMICS 365 CUSTOMER SERVICE COMPONENTS",
          "contents": [
            "Describe Knowledge Management ",
            "Describe the cases lifecycle including service-level agreements",
            "Describe how to use queues to manage work "
          ]
        }
      ]
    },
    {
      "title": "Module 4: DESCRIBE DYNAMICS 365 FIELD SERVICE (15–20%) ",
      "submodules": [
        {
          "heading": "DESCRIBE THE WORK ORDER LIFECYCLE",
          "contents": [
            "Describe the work order lifecycle",
            "Describe capabilities for of the Inspections feature ",
            "Describe customer asset management and preventive maintenance processes "
          ]
        },
        {
          "heading": "DESCRIBE SCHEDULING CAPABILITIES",
          "contents": [
            "Describe resource and scheduling processes ",
            "Describe scheduling options including Schedule Assistant, and Resource Schedule Optimization (RSO) ",
            "Describe how to enable proactive customer asset management by using Connected Field Service "
          ]
        }
      ]
    },
    {
      "title": "Module 5: DESCRIBE SHARED FEATURES (20–25%)",
      "submodules": [
        {
          "heading": "IDENTIFY COMMON CUSTOMER ENGAGEMENT FEATURES",
          "contents": [
            "Describe Microsoft Dataverse as the foundation for Dynamics 365 apps ",
            "Describe customers and activities ",
            "Describe built-in reporting capabilities including dashboards, charts, and views "
          ]
        },
        {
          "heading": "DESCRIBE REPORTING CAPABILITIES",
          "contents": [
            "Describe Microsoft Teams integration capabilities ",
            "Describe email capabilities including App for Outlook ",
            "Describe how Microsoft Excel and Microsoft Word can be used with Dynamics 365 apps ",
            "Describe options for analyzing data by using Power BI "
          ]
        }
      ]
    }
  ],
  "onCompletion": [
    "The bullets that follow each of the skills measured are intended to illustrate how we are assessing that skill. Related topics may be covered in the exam. ",
    "Most questions cover features that are general availability (GA). The exam may contain questions on Preview features if those features are commonly used."
  ],
  "batches": [
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    }
  ]
}