 {
  "title": "Managing Microsoft Teams MS - 700 ",
  "subtitle": "A master course designed for working professionals like you. Make your career soar with Loyal Bytes.",
  "heroImage": "/images/course-page/azure-hero-image.png",
  "heroBg": "/images/course-page/azure-hero-bg.png",
  "courseDetail": {
    "duration": "8 Hours",
    "certification": "MS-700 and Managing Microsoft Teams",
    "batchInfo": "Saturday and weekdays batches available",
    "level": "200",
    "highlights": [
      {
        "icon": "user",
        "color": "orange",
        "heading": "Duration",
        "subheading": "8 Hours."
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Batch Days",
        "subheading": "Saturday & Weekdays"
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Learning mode",
        "subheading": "Group, One-to-One, Corporate Batches, Online Live Classrooms"
      },
      {
        "icon": "user",
        "color": "orange",
        "heading": "Passing score",
        "subheading": "700"
      }
    ],
    "bg": "blue",
    "displayImage": "/images/course-page/azure-hightlights-image.png",
    "description": [
      "This exam measures your ability to accomplish the following technical tasks: plan and configure a Microsoft Teams environment; manage chat, teams, channels, and apps; manage calling and meetings; and monitor and troubleshoot a Microsoft Teams environment.",
      "In this course, you will learn about various Teams management tools, security and compliance feature for Teams, network requirement for Teams deployment as well as different Teams settings and policies for managing collaboration and communication experience in Teams.",
      "You will learn about Teams architecture. Specifically, you will learn about the integration between Microsoft Teams and various workloads and services in Microsoft 365.",
      "You will learn about security and compliance features for Teams, including conditional access, MFA, Threat, alerts, DLP policies, eDiscovery, and information barrier policies.",
      "You will also learn about preparing the environment for a Microsoft Teams deployment, including upgrading from Skype for Business to Microsoft Teams, network settings, and managing Microsoft Teams endpoints.",
      "Lastly, you will learn about how to create and manage teams, manage membership, including internal and external users.",
      "You will further learn about different settings and policies to manage collaboration and communication experiences in Microsoft Teams."
    ]
  },
  "idealFor": [
    "Candidates for this exam are Microsoft Teams administrators who manage Microsoft Teams to facilitate efficient and effective collaboration and communication in a Microsoft 365 environment. ",
    "Candidates for this exam must be able to plan, deploy, configure, and secure Teams chat, apps, channels, meetings, audio/video conferencing, live events, calling, and Microsoft Teams-certified devices. Candidates should have experience integrating Microsoft Teams with other workloads, including SharePoint, OneDrive, Exchange, Microsoft 365 Groups, Power Platform, and with other Microsoft apps, third-party apps, and custom apps. ",
    "A Microsoft Teams administrator also collaborates other functions, such as networking, telephony, licensing, security, compliance, user adoption, app development, and support."
  ],
  "learningObjectives": "Create beautiful web flow. Learn how to migrate and host on Microsoft Azure",
  "modules": [
    {
      "title": "Module 1: PLAN AND CONFIGURE A MICROSOFT TEAMS ENVIRONMENT (35-40%) ",
      "submodules": [
        {
          "heading": "PLAN AND CONFIGURE NETWORK SETTINGS FOR MICROSOFT TEAMS ",
          "contents": [
            "Calculate network bandwidth capacity for Microsoft Teams voice, video, meetings, and Live Events ",
            "Analyze network usage by using Network Planner ",
            "Specify requirements for outbound network ports and protocols for Microsoft Teams ",
            "Determine WAN optimizer, proxy, and load balancer recommendations for Microsoft Teams ",
            "Configure Tenant Data Upload in Microsoft Call Quality Dashboard ",
            "Configure reporting labels for Microsoft Teams ",
            "Assess network readiness by using Microsoft 365 network connectivity test and dashboard ",
            "Configure qos port range and DSCP markings "
          ]
        },
        {
          "heading": "IDENTIFY LICENSING REQUIREMENTS FOR MICROSOFT TEAMS ",
          "contents": [
            "Identify required licensing for compliance features",
            "Identify appropriate licensing for advanced lifecycle management of teams ",
            "Identify appropriate licensing for guest access ",
            "Identify appropriate licensing for calling, phone system, and resource accounts ",
            "Identify appropriate licensing for microsoft teams rooms and common area phones ",
            "Identify appropriate licensing for apps in microsoft teams "
          ]
        },
        {
          "heading": "9.1.3\tPLAN AND CONFIGURE SECURITY AND COMPLIANCE SETTINGS FOR MICROSOFT TEAMS ",
          "contents": [
            "Plan alerts for Microsoft Teams ",
            "Choose appropriate administration roles ",
            "Plan threat policies ",
            "Plan and configure retention policies ",
            "Plan and configure sensitivity labels ",
            "Plan Data Loss Prevention (DLP) policies",
            "Plan for conditional access and MFA for Microsoft Teams ",
            "Plan information barrier policies "
          ]
        },
        {
          "heading": "PLAN AND IMPLEMENT GOVERNANCE AND LIFECYCLE MANAGEMENT FOR MICROSOFT TEAMS ",
          "contents": [
            "Plan and manage Microsoft Teams preview features with Microsoft Teams update policies ",
            "Create and manage policy packages in Microsoft Teams.",
            "Plan policy assignment for users and groups ",
            "Set up policies for Microsoft 365 Groups creation ",
            "Configure an expiration policy for Microsoft 365 groups ",
            "Configure a naming policy for Microsoft 365 Groups ",
            "Archive, delete, or unarchive one or more teams ",
            "Restore or troubleshoot deletion of one or more Microsoft 365 Groups ",
            "Manage Azure AD access review for members and guests ",
            "Perform bulk user operations with powershell "
          ]
        },
        {
          "heading": "CONFIGURE AND MANAGE EXTERNAL AND GUEST USERS ",
          "contents": [
            "Configure sharepoint and onedrive organizational level sharing settings ",
            "Manage external file sharing setting for onedrive users ",
            "Manage external file sharing setting for sharepoint sites ",
            "Manage external access-federated domains ",
            "Manage guest users for Microsoft Teams from the Microsoft Teams Admin Center ",
            "Configure guest access to Microsoft Teams from Azure AD admin center ",
            "Allow or prevent owners from adding guests ",
            "Configure guest access to a specific team ",
            "Remove guests "
          ]
        },
        {
          "heading": "CONFIGURE AND MANAGE MICROSOFT TEAMS DEVICES ",
          "contents": [
            "Configure Microsoft Teams for VDI ",
            "Manage configuration profiles for Teams devices ",
            "Manage Microsoft Teams device tags ",
            "Manage device settings and firmware ",
            "Provision and configure remote sign-in for new devices "
          ]
        }
      ]
    },
    {
      "title": "Module 2: MANAGE CHAT, TEAMS, CHANNELS, AND APPS (25-30%)",
      "submodules": [
        {
          "heading": "CREATE AND MANAGE TEAMS ",
          "contents": [
            "Create teams ",
            "Manage privacy levels for a team ",
            "Create a team from a default or custom template ",
            "Create a team from existing resources ",
            "Plan and manage org-wide teams ",
            "Add and remove users in a team ",
            "Assign and modify user roles in a team ",
            "Configure dynamic membership "
          ]
        },
        {
          "heading": "PLAN AND MANAGE CHANNELS ",
          "contents": [
            "Plan for channel types ",
            "Create channels ",
            "Manage microsoft teams channel settings ",
            "Create and manage microsoft teams policies for private channels ",
            "Manage private channel membership "
          ]
        },
        {
          "heading": "MANAGE CHAT AND COLLABORATION EXPERIENCES ",
          "contents": [
            "Create and manage messaging policies ",
            "Configure email integration from microsoft teams settings ",
            "Manage cloud file storage options ",
            "Choose an appropriate coexistence mode "
          ]
        },
        {
          "heading": "MANAGE APPS FOR MICROSOFT TEAMS ",
          "contents": [
            "Manage Org-wide app settings ",
            "Create and manage app permission policies ",
            "Create and manage app setup policies ",
            "Add apps, connectors, tabs, and messaging extensions to a team ",
            "Customize the app store ",
            "Publish and configure a custom app to Microsoft Teams "
          ]
        }
      ]
    },
    {
      "title": "Module 3: MANAGE CALLING AND MEETINGS (15-20%)",
      "submodules": [
        {
          "heading": "MANAGE MEETING EXPERIENCES ",
          "contents": [
            "Configure meeting settings ",
            "Create and manage meeting policies ",
            "Create and manage conference bridges ",
            "Configure live events settings ",
            "Create and manage live events policies ",
            "Configure and manage teams cloud meeting recording "
          ]
        },
        {
          "heading": "MANAGE PHONE NUMBERS ",
          "contents": [
            "Evaluate when to use Calling Plan versus Direct Routing",
            "Plan and configure emergency calling policies ",
            "Add, change, or remove an emergency address for your organization ",
            "Provision and manage organizational phone numbers for users, services, and conferencing bridges ",
            "Assign, change, or remove a phone number for a user ",
            "Assign a phone number to a resource account "
          ]
        },
        {
          "heading": "MANAGE PHONE SYSTEM FOR MICROSOFT TEAMS ",
          "contents": [
            "Create and manage call park policies ",
            "Create and manage calling policies ",
            "Create and manage caller id policies ",
            "Manage user voice settings ",
            "Create and manage dial plans ",
            "Interpret a dial plan ",
            "Identify potential issues by using the health dashboard for direct routing ",
            "Create and manage resource accounts ",
            "Create and manage call queues ",
            "Create and manage auto attendants"
          ]
        }
      ]
    },
    {
      "title": "Module 4: MONITOR AND TROUBLESHOOT A MICROSOFT TEAMS ENVIRONMENT (10-15%) ",
      "submodules": [
        {
          "heading": "MONITOR AND REPORT ON A MICROSOFT TEAMS ENVIRONMENT",
          "contents": [
            "Monitor and report on voice and meeting quality ",
            "Report on user adoption, including productivity score, team usage, app usage, active users, and per-meeting metrics ",
            "Monitor and report on creation and deletion of teams ",
            "Monitor and report on guest access ",
            "Manage notifications & alerts rules from the microsoft teams admin center "
          ]
        },
        {
          "heading": "9.4.2\tTROUBLESHOOT AUDIO, VIDEO, AND CLIENT ISSUES ",
          "contents": [
            "Troubleshoot chat and presence issues ",
            "Identify, collect, and interpret client logs ",
            "Troubleshoot issues by using call analytics ",
            "Troubleshoot microsoft teams sign-in issues by using azure ad sign in logs ",
            "Identify potential issues by using call quality dashboard "
          ]
        }
      ]
    }
  ],
  "onCompletion": [
    "The bullets that follow each of the skills measured are intended to illustrate how we are assessing that skill. Related topics may be covered in the exam.",
    "Most questions cover features that are general availability (GA). The exam may contain questions on Preview features if those features are commonly used."
  ],
  "batches": [
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    }
  ]
}