 {
  "title": "Security Administrator Associate MS - 500",
  "subtitle": "A master course designed for working professionals like you. Make your career soar with Loyal Bytes.",
  "heroImage": "/images/course-page/azure-hero-image.png",
  "heroBg": "/images/course-page/azure-hero-bg.png",
  "courseDetail": {
    "duration": "40 Hours",
    "certification": "DP – 203 and Data Engineering on Microsoft Azure",
    "batchInfo": "Weekends and weekdays batches available",
    "level": "200",
    "highlights": [
      {
        "icon": "user",
        "color": "orange",
        "heading": "Duration",
        "subheading": "32 Hours."
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Batch Days",
        "subheading": "Weekdays, Weekends"
      },
      {
        "icon": "user ",
        "color": "orange",
        "heading": "Learningmode",
        "subheading": "Group, One-to-One, Corporate Batches, Online Live Classrooms"
      },
      {
        "icon": "user",
        "color": "orange",
        "heading": "Passing score",
        "subheading": "700"
      }
    ],
    "bg": "blue",
    "displayImage": "/images/course-page/azure-hightlights-image.png",
    "description": "The opportunity in cloud computing is clear. Most companies are implementing or investigating how to implement cloud technologies within their operations. One big topic is securing all cloud workloads and services. Don't be left behind. Be ahead of the curve by getting certified as a Microsoft 365 Security Administrator and be ready for the opportunity to advance your career. In this course you will learn\t how to secure user access to your organization’s resources. The course covers user password protection, multi-factor authentication, how to enable Azure Identity Protection, how to setup and use Azure AD Connect, and introduces you to conditional access in Microsoft 365. You will learn about threat protection technologies that help protect your Microsoft 365 environment. Specifically, you will learn about threat vectors and Microsoft’s security solutions to mitigate threats. You will learn about Secure Score, Exchange Online protection, Azure Advanced Threat Protection, Windows Defender Advanced Threat Protection, and threat management. In the course you will learn about information protection technologies that help secure your Microsoft 365 environment. The course discusses information rights managed content, message encryption, as well as labels, policies and rules that support data loss prevention and information protection. Lastly, you will learn about archiving and retention in Microsoft 365 as well as data governance and how to conduct content searches and investigations. This course covers data retention policies and tags, in-place records management for SharePoint, email retention, and how to conduct content searches that support eDiscovery investigations."
  },
  "idealFor": "Candidates for this exam implement, manage, and monitor security and compliance solutions for Microsoft 365 and hybrid environments. The Microsoft 365 security administrator proactively secures Microsoft 365 enterprise environments, responds to threats, performs investigations, and enforces data governance. The Microsoft 365 security administrator collaborates with the Microsoft 365 enterprise administrator, business stakeholders, and other workload administrators to plan and implement security strategies and ensures that the solutions comply with the policies and regulations of the organization. Candidates for this exam are familiar with Microsoft 365 workloads and have strong skills and experience with identity protection, information protection, threat protection, security management, and data governance. This role focuses on the Microsoft 365 environment and includes hybrid environments.",
  "learningObjectives": "Create beautiful web flow. Learn how to migrate and host on Microsoft Azure",
  "modules": [
    {
      "title": "Module 1:  IMPLEMENT AND MANAGE IDENTITY AND ACCESS (35-40%) ",
      "submodules": [
        {
          "heading": "SECURE MICROSOFT 365 HYBRID ENVIRONMENTS ",
          "contents": [
            "Plan Azure AD authentication options",
            "Plan Azure AD synchronization options",
            "Monitor and troubleshoot Azure AD Connect events"
          ]
        },
        {
          "heading": "SECURE IDENTITIES ",
          "contents": [
            "Implement Azure AD group membership",
            "Implement password management",
            "Manage external identities in Azure AD and Microsoft 365 workloads "
          ]
        },
        {
          "heading": "IMPLEMENT AUTHENTICATION METHODS ",
          "contents": [
            "Implement multi-factor authentication (MFA) by using conditional access policy ",
            "Manage and monitor MFA ",
            "Plan and implement device authentication methods like Windows Hello"
          ]
        },
        {
          "heading": "IMPLEMENT CONDITIONAL ACCESS ",
          "contents": [
            "Plan for compliance and conditional access policies",
            "Configure and manage device compliance policies",
            "Implement and manage conditional access",
            "Test and troubleshoot conditional access policies "
          ]
        },
        {
          "heading": "IMPLEMENT ROLES AND ROLE GROUPS ",
          "contents": [
            "Plan for roles and role groups",
            "Configure roles and role groups",
            "Audit roles for least privileged access "
          ]
        },
        {
          "heading": "CONFIGURE AND MANAGE IDENTITY GOVERNANCE ",
          "contents": [
            "Implement Azure AD Privileged Identity Management",
            "Implement and manage entitlement management",
            "Implement and manage access reviews"
          ]
        },
        {
          "heading": "IMPLEMENT AZURE AD IDENTITY PROTECTION ",
          "contents": [
            "Implement user risk policy",
            "Implement sign-in risk policy",
            "Configure identity protection alerts",
            "Review and respond to risk events"
          ]
        }
      ]
    },
    {
      "title": "Module 2: IMPLEMENT AND MANAGE THREAT PROTECTION (25-30%)",
      "submodules": [
        {
          "heading": "IMPLEMENT AND MANAGE MICROSOFT DEFENDER FOR IDENTITY ",
          "contents": [
            "Plan a Microsoft Defender for Identity solution ",
            "Install and configure Microsoft Defender for Identity ",
            "Monitor and manage Microsoft Defender for Identity"
          ]
        },
        {
          "heading": "IMPLEMENT DEVICE THREAT PROTECTION ",
          "contents": [
            "Plan a Microsoft Defender for Endpoint solution",
            "Implement Microsoft Defender for Endpoint ",
            "Manage and monitor Microsoft Defender for Endpoint "
          ]
        },
        {
          "heading": "IMPLEMENT AND MANAGE DEVICE AND APPLICATION PROTECTION ",
          "contents": [
            "Plan for device and application protection",
            "Configure and manage microsoft defender application guard ",
            "Configure and manage microsoft defender application control ",
            "Configure and manage exploit protection ",
            "Configure and manage windows device encryption ",
            "Configure and manage non-windows device encryption ",
            "Implement application protection policies ",
            "Configure and manage device compliance for endpoint security "
          ]
        },
        {
          "heading": "IMPLEMENT AND MANAGE MICROSOFT DEFENDER FOR OFFICE 365 ",
          "contents": [
            "Configure Microsoft Defender for Office 365",
            "Monitor for and remediate threats using Microsoft Defender for Office 365 ",
            "Conduct simulated attacks using Attack Simulation training "
          ]
        },
        {
          "heading": "MONITOR MICROSOFT 365 SECURITY WITH MICROSOFT SENTINEL",
          "contents": [
            "Plan and implement Microsoft Sentinel ",
            "Configure playbooks in Microsoft Sentinel ",
            "Manage and monitor with Microsoft Sentinel ",
            "Respond to threats using built-in playbooks in Microsoft Sentinel "
          ]
        },
        {
          "heading": "IMPLEMENT AND MANAGE MICROSOFT DEFENDER FOR CLOUD APPS SECURITY ",
          "contents": [
            "Plan Microsoft Defender for Cloud Apps implementation",
            "Configure Microsoft Defender for Cloud Apps ",
            "Manage cloud app discovery ",
            "Manage entries in the Microsoft Defender for Cloud App catalog ",
            "Manage apps in Microsoft Defender for Cloud Apps ",
            "Configure Microsoft Defender Cloud Apps connectors and oauth apps ",
            "Configure Microsoft Defender for Cloud Apps policies and templates ",
            "Review, interpret and respond to Microsoft Defender for Cloud Apps alerts, reports, dashboards, and logs "
          ]
        }
      ]
    },
    {
      "title": "Module 3: IMPLEMENT AND MANAGE INFORMATION PROTECTION (10-15%)  ",
      "submodules": [
        {
          "heading": "9.3.1\tMANAGE SENSITIVE INFORMATION ",
          "contents": [
            "Plan a sensitivity label solution ",
            "Create and manage sensitive information types ",
            "Configure sensitivity labels and policies. ",
            "Configure and use activity explorer ",
            "Use sensitivity labels with teams, sharepoint, onedrive and office apps"
          ]
        },
        {
          "heading": "MANAGE DATA LOSS PREVENTION (DLP) ",
          "contents": [
            "Plan a DLP solution ",
            "Create and manage DLP policies for Microsoft 365 workloads  ",
            "Create and manage sensitive information types  ",
            "Monitor DLP reports  ",
            "Manage DLP notifications  ",
            "Implement Endpoint DLP "
          ]
        },
        {
          "heading": "9.3.3\tMANAGE DATA GOVERNANCE AND RETENTION ",
          "contents": [
            "Plan for data governance and retention ",
            "Review and interpret data governance reports and dashboards ",
            "Configure retention labels and policies ",
            "Configure retention in microsoft 365 workloads ",
            "Find and recover deleted office 365 data ",
            "Configure and use microsoft 365 records management "
          ]
        }
      ]
    },
    {
      "title": "Module 4: MANAGE GOVERNANCE AND COMPLIANCE FEATURES IN MICROSOFT 365 (20-25%) ",
      "submodules": [
        {
          "heading": "CONFIGURE AND ANALYZE SECURITY REPORTING ",
          "contents": [
            "Monitor and manage device security status using Microsoft Endpoint Manager admin center. ",
            "Manage and monitor security reports and dashboards using Microsoft 365 Defender portal plan for custom security reporting with Graph Security API ",
            "Use secure score dashboards to review actions and recommendations "
          ]
        },
        {
          "heading": "9.4.2\tMANAGE AND ANALYZE AUDIT LOGS AND REPORTS ",
          "contents": [
            "Plan for auditing and reporting ",
            "Perform audit log search ",
            "Review and interpret compliance reports and dashboards ",
            "Configure alert policies"
          ]
        },
        {
          "heading": "9.4.3\tDISCOVER AND RESPOND TO COMPLIANCE QUERIES IN MICROSOFT 365 ",
          "contents": [
            "Plan for content search and ediscovery ",
            "Delegate permissions to use search and discovery tools ",
            "Use search and investigation tools to discover and respond ",
            "Manage ediscovery cases "
          ]
        },
        {
          "heading": "9.4.4\tMANAGE REGULATORY COMPLIANCE ",
          "contents": [
            "Plan for regulatory compliance in Microsoft 365 ",
            "Manage Data Subject Requests (dsrs) ",
            "Administer Compliance Manager in Microsoft 365 compliance center ",
            "Use Compliance Manager "
          ]
        },
        {
          "heading": "9.4.5\tMANAGE INSIDER RISK SOLUTIONS IN MICROSOFT 365 ",
          "contents": [
            "Implement and manage Customer Lockbox ",
            "Implement and manage communication compliance policies ",
            "Implement and manage Insider risk management policies ",
            "Implement and manage information barrier policies ",
            "Implement and manage privileged access management "
          ]
        }
      ]
    }
  ],
  "onCompletion": [
    "The bullets that follow each of the skills measured are intended to illustrate how we are assessing that skill. Related topics may not be covered in the exam.",
    "Most questions cover features that are general availability (GA). The exam may contain questions on Preview features if those features are commonly used."
  ],
  "batches": [
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    },
    {
      "id": "",
      "days": "",
      "mode": "",
      "time": "",
      "duration": ""
    }
  ]
}